city_coords = [
    (0, 0, 'Київ'),
    (55, 125, 'Чернігів'),
    (310, 60, 'Суми'),
    (410, -45, 'Харків'),
    (110, -110, 'Черкаси'),
    (295, -85, 'Полтава'),
    (120, -215, 'Кропивницький'),
    (330, -220, 'Дніпро'),
    (340, -290, 'Запоріжжя'),
    (535, -270, 'Донецьк'),
    (645, -210, 'Луганськ'),
    (105, -390, 'Миколаїв'),
    (150, -420, 'Херсон'),
    (10, -440, 'Одеса'),
    (215, -635, 'Севастопіль'),
    (-140, -15, 'Житомир'),
    (-155, -140, 'Вінниця'),
    (-480, -60, 'Львів'),
    (-385, 40, 'Луцьк'),
    (-320, 20, 'Рівне'),
    (-365, -100, 'Тернопіль'),
    (-265, -110, 'Хмельницький'),
    (-340, -240, 'Чернівці'),
    (-430, -170, 'Івано-Франківськ'),
    (-605, -200, 'Ужгород')
]

ukr_west = [
    (-480, -60, 'Львів'),
    (-385, 40, 'Луцьк'),
    (-320, 20, 'Рівне'),
    (-365, -100, 'Тернопіль'),
    (-265, -110, 'Хмельницький'),
    (-340, -240, 'Чернівці'),
    (-430, -170, 'Івано-Франківськ'),
    (-605, -200, 'Ужгород')
]

# ukr_west = [
#     (0, 0, 'Львів'),
#     (3.1, 4.5, 'Луцьк'),
#     (5.2, 4, 'Рівне'),
#     (7.1, -1.5, 'Хмельницький'),
#     (4.5, -5.7, 'Чернівці'),
#     (3.8, -1, 'Тернопіль'),
#     (1.5, -3.4, 'Франківськ'),
#     (-4.2, -4.5, 'Ужгород')
# ]

