import matplotlib.pyplot as plt

def maps(cities, route):
    x = [cities[i][0] for i in route]
    y = [cities[i][1] for i in route]

    plt.figure(figsize=(8, 8))
    plt.plot(x, y, '-o', label="Маршрут")
    # plt.scatter(x, y, c='red', label="Міста")
    
    for i, (xi, yi, name) in enumerate(cities):
        plt.text(xi, yi, f"{i + 1}. {name}", fontsize=6, ha='right')

    plt.title("Оптимальний маршрут комівояджера")
    plt.xlabel("X-координата")
    plt.ylabel("Y-координата")
    plt.legend()
    plt.grid()
    plt.show()

city_coords = [
    (0, 0, 'Київ'),
    (55, 125, 'Чернігів'),
    (310, 60, 'Суми'),
    (410, -45, 'Харків'),
    (110, -110, 'Черкаси'),
    (295, -85, 'Полтава'),
    (120, -215, 'Кропивницький'),
    (205, -280, 'Кривий Ріг'),
    (330, -220, 'Дніпро'),
    (340, -290, 'Запоріжжя'),
    (535, -270, 'Донецьк'),
    (645, -210, 'Луганськ'),
    (205, -390, 'Миколаїв'),
    (150, -420, 'Херсон'),
    (10, -440, 'Одеса'),
    (215, -635, 'Севастопіль'),
    (-140, -15, 'Житомир'),
    (-155, -140, 'Вінниця'),
    (-265, -110, 'Хмельницький'),
    (-340, -240, 'Чернівці'),
    (-365, -100, 'Тернопіль'),
    (-430, -170, 'Івано-Франківськ'),
    (-480, -60, 'Львів'),
    (-605, -200, 'Ужгород'),
    (-320, 20, 'Рівне'),
    (-385, 40, 'Луцьк')
]

maps(city_coords, range(len(city_coords)))